sdaiUndoChanges(Sdai_instS*)
\details
Reverts changes made within a specified model.
\param model [in] A model to revert changes.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.